; domain
(define (domain blocksworld)
  (:requirements :strips :constraints :negative-preconditions)
  (:predicates (clear ?x)
               (on-table ?x)
               (arm-empty)
               (holding ?x)
               (on ?x ?y))

  (:action pickup
    :parameters (?ob)
    :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
    :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob)) 
                 (not (arm-empty))))

  (:action putdown
    :parameters  (?ob)
    :precondition (holding ?ob)
    :effect (and (clear ?ob) (arm-empty) (on-table ?ob) 
                 (not (holding ?ob))))

  (:action stack
    :parameters  (?ob ?underob)
    :precondition (and (clear ?underob) (holding ?ob))
    :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
                 (not (clear ?underob)) (not (holding ?ob))))

  (:action unstack
    :parameters  (?ob ?underob)
    :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
    :effect (and (holding ?ob) (clear ?underob)
                 (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
(define (problem BW-rand-29)
(:domain blocksworld)
(:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 )
(:init
(arm-empty)
(on b1 b9)
(on b2 b20)
(on b3 b10)
(on b4 b12)
(on b5 b15)
(on b6 b21)
(on-table b7)
(on b8 b3)
(on b9 b17)
(on b10 b11)
(on b11 b6)
(on b12 b25)
(on b13 b2)
(on b14 b16)
(on b15 b24)
(on b16 b22)
(on-table b17)
(on b18 b29)
(on-table b19)
(on b20 b26)
(on b21 b27)
(on b22 b4)
(on b23 b13)
(on-table b24)
(on b25 b23)
(on b26 b8)
(on b27 b19)
(on b28 b14)
(on b29 b5)
(clear b1)
(clear b7)
(clear b18)
(clear b28)
)
(:goal
(and
(on b1 b24)
(on b2 b18)
(on-table b3)
(on b4 b6)
(on b5 b9)
(on b6 b2)
(on b7 b29)
(on-table b8)
(on b9 b7)
(on b10 b11)
(on b11 b28)
(on b12 b27)
(on b13 b10)
(on b14 b19)
(on b15 b13)
(on b16 b1)
(on b17 b26)
(on b18 b8)
(on b19 b3)
(on-table b20)
(on b21 b5)
(on b22 b4)
(on-table b23)
(on b24 b21)
(on b25 b15)
(on b26 b23)
(on b27 b25)
(on b28 b20)
(on b29 b22))
)
)

; plan
1. (unstack b18 b29)
   deleted: (on b18 b29) (clear b18) (arm-empty)
   added: (holding b18) (clear b29)
   goals met: 2 of 29
2. (putdown b18)
   deleted: (holding b18)
   added: (clear b18) (arm-empty) (on-table b18)
   goals met: 2 of 29
3. (pickup b7)
   deleted: (clear b7) (on-table b7) (arm-empty)
   added: (holding b7)
   goals met: 2 of 29
4. (stack b7 b29)
   deleted: (clear b29) (holding b7)
   added: (arm-empty) (clear b7) (on b7 b29)
   goals met: 3 of 29
5. (unstack b1 b9)
   deleted: (on b1 b9) (clear b1) (arm-empty)
   added: (holding b1) (clear b9)
   goals met: 3 of 29
6. (putdown b1)
   deleted: (holding b1)
   added: (clear b1) (arm-empty) (on-table b1)
   goals met: 3 of 29
7. (unstack b9 b17)
   deleted: (on b9 b17) (clear b9) (arm-empty)
   added: (holding b9) (clear b17)
   goals met: 3 of 29
8. (stack b9 b7)
   deleted: (clear b7) (holding b9)
   added: (arm-empty) (clear b9) (on b9 b7)
   goals met: 4 of 29
9. (unstack b28 b14)
   deleted: (on b28 b14) (clear b28) (arm-empty)
   added: (holding b28) (clear b14)
   goals met: 4 of 29
10. (putdown b28)
   deleted: (holding b28)
   added: (clear b28) (arm-empty) (on-table b28)
   goals met: 4 of 29
11. (unstack b14 b16)
   deleted: (on b14 b16) (clear b14) (arm-empty)
   added: (holding b14) (clear b16)
   goals met: 4 of 29
12. (putdown b14)
   deleted: (holding b14)
   added: (clear b14) (arm-empty) (on-table b14)
   goals met: 4 of 29
13. (unstack b16 b22)
   deleted: (on b16 b22) (clear b16) (arm-empty)
   added: (holding b16) (clear b22)
   goals met: 4 of 29
14. (stack b16 b1)
   deleted: (clear b1) (holding b16)
   added: (arm-empty) (clear b16) (on b16 b1)
   goals met: 5 of 29
15. (unstack b22 b4)
   deleted: (on b22 b4) (clear b22) (arm-empty)
   added: (holding b22) (clear b4)
   goals met: 4 of 29
16. (putdown b22)
   deleted: (holding b22)
   added: (clear b22) (arm-empty) (on-table b22)
   goals met: 4 of 29
17. (unstack b4 b12)
   deleted: (on b4 b12) (clear b4) (arm-empty)
   added: (holding b4) (clear b12)
   goals met: 4 of 29
18. (putdown b4)
   deleted: (holding b4)
   added: (clear b4) (arm-empty) (on-table b4)
   goals met: 4 of 29
19. (unstack b12 b25)
   deleted: (on b12 b25) (clear b12) (arm-empty)
   added: (holding b12) (clear b25)
   goals met: 4 of 29
20. (putdown b12)
   deleted: (holding b12)
   added: (clear b12) (arm-empty) (on-table b12)
   goals met: 4 of 29
21. (unstack b25 b23)
   deleted: (on b25 b23) (clear b25) (arm-empty)
   added: (holding b25) (clear b23)
   goals met: 4 of 29
22. (putdown b25)
   deleted: (holding b25)
   added: (clear b25) (arm-empty) (on-table b25)
   goals met: 4 of 29
23. (unstack b23 b13)
   deleted: (on b23 b13) (clear b23) (arm-empty)
   added: (holding b23) (clear b13)
   goals met: 4 of 29
24. (putdown b23)
   deleted: (holding b23)
   added: (clear b23) (arm-empty) (on-table b23)
   goals met: 5 of 29
25. (pickup b22)
   deleted: (clear b22) (on-table b22) (arm-empty)
   added: (holding b22)
   goals met: 5 of 29
26. (stack b22 b4)
   deleted: (clear b4) (holding b22)
   added: (arm-empty) (clear b22) (on b22 b4)
   goals met: 6 of 29
27. (unstack b13 b2)
   deleted: (on b13 b2) (clear b13) (arm-empty)
   added: (holding b13) (clear b2)
   goals met: 6 of 29
28. (putdown b13)
   deleted: (holding b13)
   added: (clear b13) (arm-empty) (on-table b13)
   goals met: 6 of 29
29. (unstack b2 b20)
   deleted: (on b2 b20) (clear b2) (arm-empty)
   added: (holding b2) (clear b20)
   goals met: 6 of 29
30. (stack b2 b18)
   deleted: (clear b18) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b18)
   goals met: 7 of 29
31. (unstack b20 b26)
   deleted: (on b20 b26) (clear b20) (arm-empty)
   added: (holding b20) (clear b26)
   goals met: 7 of 29
32. (putdown b20)
   deleted: (holding b20)
   added: (clear b20) (arm-empty) (on-table b20)
   goals met: 8 of 29
33. (pickup b28)
   deleted: (clear b28) (on-table b28) (arm-empty)
   added: (holding b28)
   goals met: 8 of 29
34. (stack b28 b20)
   deleted: (clear b20) (holding b28)
   added: (arm-empty) (clear b28) (on b28 b20)
   goals met: 9 of 29
35. (unstack b26 b8)
   deleted: (on b26 b8) (clear b26) (arm-empty)
   added: (holding b26) (clear b8)
   goals met: 9 of 29
36. (stack b26 b23)
   deleted: (clear b23) (holding b26)
   added: (arm-empty) (clear b26) (on b26 b23)
   goals met: 10 of 29
37. (unstack b8 b3)
   deleted: (on b8 b3) (clear b8) (arm-empty)
   added: (holding b8) (clear b3)
   goals met: 10 of 29
38. (putdown b8)
   deleted: (holding b8)
   added: (clear b8) (arm-empty) (on-table b8)
   goals met: 11 of 29
39. (unstack b3 b10)
   deleted: (on b3 b10) (clear b3) (arm-empty)
   added: (holding b3) (clear b10)
   goals met: 11 of 29
40. (putdown b3)
   deleted: (holding b3)
   added: (clear b3) (arm-empty) (on-table b3)
   goals met: 12 of 29
41. (pickup b17)
   deleted: (clear b17) (on-table b17) (arm-empty)
   added: (holding b17)
   goals met: 12 of 29
42. (stack b17 b26)
   deleted: (clear b26) (holding b17)
   added: (arm-empty) (clear b17) (on b17 b26)
   goals met: 13 of 29
43. (pickup b13)
   deleted: (clear b13) (on-table b13) (arm-empty)
   added: (holding b13)
   goals met: 13 of 29
44. (stack b13 b10)
   deleted: (clear b10) (holding b13)
   added: (arm-empty) (clear b13) (on b13 b10)
   goals met: 14 of 29
45. (unstack b2 b18)
   deleted: (on b2 b18) (clear b2) (arm-empty)
   added: (holding b2) (clear b18)
   goals met: 13 of 29
46. (putdown b2)
   deleted: (holding b2)
   added: (clear b2) (arm-empty) (on-table b2)
   goals met: 13 of 29
47. (pickup b18)
   deleted: (clear b18) (on-table b18) (arm-empty)
   added: (holding b18)
   goals met: 13 of 29
48. (stack b18 b8)
   deleted: (clear b8) (holding b18)
   added: (arm-empty) (clear b18) (on b18 b8)
   goals met: 14 of 29
49. (pickup b2)
   deleted: (clear b2) (on-table b2) (arm-empty)
   added: (holding b2)
   goals met: 14 of 29
50. (stack b2 b18)
   deleted: (clear b18) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b18)
   goals met: 15 of 29
51. (unstack b13 b10)
   deleted: (on b13 b10) (clear b13) (arm-empty)
   added: (holding b13) (clear b10)
   goals met: 14 of 29
52. (putdown b13)
   deleted: (holding b13)
   added: (clear b13) (arm-empty) (on-table b13)
   goals met: 14 of 29
53. (unstack b10 b11)
   deleted: (on b10 b11) (clear b10) (arm-empty)
   added: (holding b10) (clear b11)
   goals met: 13 of 29
54. (putdown b10)
   deleted: (holding b10)
   added: (clear b10) (arm-empty) (on-table b10)
   goals met: 13 of 29
55. (pickup b13)
   deleted: (clear b13) (on-table b13) (arm-empty)
   added: (holding b13)
   goals met: 13 of 29
56. (stack b13 b10)
   deleted: (clear b10) (holding b13)
   added: (arm-empty) (clear b13) (on b13 b10)
   goals met: 14 of 29
57. (unstack b11 b6)
   deleted: (on b11 b6) (clear b11) (arm-empty)
   added: (holding b11) (clear b6)
   goals met: 14 of 29
58. (stack b11 b28)
   deleted: (clear b28) (holding b11)
   added: (arm-empty) (clear b11) (on b11 b28)
   goals met: 15 of 29
59. (unstack b6 b21)
   deleted: (on b6 b21) (clear b6) (arm-empty)
   added: (holding b6) (clear b21)
   goals met: 15 of 29
60. (stack b6 b2)
   deleted: (clear b2) (holding b6)
   added: (arm-empty) (clear b6) (on b6 b2)
   goals met: 16 of 29
61. (unstack b22 b4)
   deleted: (on b22 b4) (clear b22) (arm-empty)
   added: (holding b22) (clear b4)
   goals met: 15 of 29
62. (putdown b22)
   deleted: (holding b22)
   added: (clear b22) (arm-empty) (on-table b22)
   goals met: 15 of 29
63. (pickup b4)
   deleted: (clear b4) (on-table b4) (arm-empty)
   added: (holding b4)
   goals met: 15 of 29
64. (stack b4 b6)
   deleted: (clear b6) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b6)
   goals met: 16 of 29
65. (pickup b22)
   deleted: (clear b22) (on-table b22) (arm-empty)
   added: (holding b22)
   goals met: 16 of 29
66. (stack b22 b4)
   deleted: (clear b4) (holding b22)
   added: (arm-empty) (clear b22) (on b22 b4)
   goals met: 17 of 29
67. (unstack b13 b10)
   deleted: (on b13 b10) (clear b13) (arm-empty)
   added: (holding b13) (clear b10)
   goals met: 16 of 29
68. (putdown b13)
   deleted: (holding b13)
   added: (clear b13) (arm-empty) (on-table b13)
   goals met: 16 of 29
69. (pickup b10)
   deleted: (clear b10) (on-table b10) (arm-empty)
   added: (holding b10)
   goals met: 16 of 29
70. (stack b10 b11)
   deleted: (clear b11) (holding b10)
   added: (arm-empty) (clear b10) (on b10 b11)
   goals met: 17 of 29
71. (pickup b13)
   deleted: (clear b13) (on-table b13) (arm-empty)
   added: (holding b13)
   goals met: 17 of 29
72. (stack b13 b10)
   deleted: (clear b10) (holding b13)
   added: (arm-empty) (clear b13) (on b13 b10)
   goals met: 18 of 29
73. (unstack b21 b27)
   deleted: (on b21 b27) (clear b21) (arm-empty)
   added: (holding b21) (clear b27)
   goals met: 18 of 29
74. (putdown b21)
   deleted: (holding b21)
   added: (clear b21) (arm-empty) (on-table b21)
   goals met: 18 of 29
75. (unstack b27 b19)
   deleted: (on b27 b19) (clear b27) (arm-empty)
   added: (holding b27) (clear b19)
   goals met: 18 of 29
76. (stack b27 b25)
   deleted: (clear b25) (holding b27)
   added: (arm-empty) (clear b27) (on b27 b25)
   goals met: 19 of 29
77. (pickup b19)
   deleted: (clear b19) (on-table b19) (arm-empty)
   added: (holding b19)
   goals met: 19 of 29
78. (stack b19 b3)
   deleted: (clear b3) (holding b19)
   added: (arm-empty) (clear b19) (on b19 b3)
   goals met: 20 of 29
79. (pickup b14)
   deleted: (clear b14) (on-table b14) (arm-empty)
   added: (holding b14)
   goals met: 20 of 29
80. (stack b14 b19)
   deleted: (clear b19) (holding b14)
   added: (arm-empty) (clear b14) (on b14 b19)
   goals met: 21 of 29
81. (pickup b12)
   deleted: (clear b12) (on-table b12) (arm-empty)
   added: (holding b12)
   goals met: 21 of 29
82. (stack b12 b27)
   deleted: (clear b27) (holding b12)
   added: (arm-empty) (clear b12) (on b12 b27)
   goals met: 22 of 29
83. (unstack b9 b7)
   deleted: (on b9 b7) (clear b9) (arm-empty)
   added: (holding b9) (clear b7)
   goals met: 21 of 29
84. (putdown b9)
   deleted: (holding b9)
   added: (clear b9) (arm-empty) (on-table b9)
   goals met: 21 of 29
85. (unstack b7 b29)
   deleted: (on b7 b29) (clear b7) (arm-empty)
   added: (holding b7) (clear b29)
   goals met: 20 of 29
86. (putdown b7)
   deleted: (holding b7)
   added: (clear b7) (arm-empty) (on-table b7)
   goals met: 20 of 29
87. (pickup b9)
   deleted: (clear b9) (on-table b9) (arm-empty)
   added: (holding b9)
   goals met: 20 of 29
88. (stack b9 b7)
   deleted: (clear b7) (holding b9)
   added: (arm-empty) (clear b9) (on b9 b7)
   goals met: 21 of 29
89. (unstack b29 b5)
   deleted: (on b29 b5) (clear b29) (arm-empty)
   added: (holding b29) (clear b5)
   goals met: 21 of 29
90. (stack b29 b22)
   deleted: (clear b22) (holding b29)
   added: (arm-empty) (clear b29) (on b29 b22)
   goals met: 22 of 29
91. (unstack b5 b15)
   deleted: (on b5 b15) (clear b5) (arm-empty)
   added: (holding b5) (clear b15)
   goals met: 22 of 29
92. (stack b5 b9)
   deleted: (clear b9) (holding b5)
   added: (arm-empty) (clear b5) (on b5 b9)
   goals met: 23 of 29
93. (pickup b21)
   deleted: (clear b21) (on-table b21) (arm-empty)
   added: (holding b21)
   goals met: 23 of 29
94. (stack b21 b5)
   deleted: (clear b5) (holding b21)
   added: (arm-empty) (clear b21) (on b21 b5)
   goals met: 24 of 29
95. (unstack b15 b24)
   deleted: (on b15 b24) (clear b15) (arm-empty)
   added: (holding b15) (clear b24)
   goals met: 24 of 29
96. (stack b15 b13)
   deleted: (clear b13) (holding b15)
   added: (arm-empty) (clear b15) (on b15 b13)
   goals met: 25 of 29
97. (pickup b24)
   deleted: (clear b24) (on-table b24) (arm-empty)
   added: (holding b24)
   goals met: 25 of 29
98. (stack b24 b21)
   deleted: (clear b21) (holding b24)
   added: (arm-empty) (clear b24) (on b24 b21)
   goals met: 26 of 29
99. (unstack b16 b1)
   deleted: (on b16 b1) (clear b16) (arm-empty)
   added: (holding b16) (clear b1)
   goals met: 25 of 29
100. (putdown b16)
   deleted: (holding b16)
   added: (clear b16) (arm-empty) (on-table b16)
   goals met: 25 of 29
101. (pickup b1)
   deleted: (clear b1) (on-table b1) (arm-empty)
   added: (holding b1)
   goals met: 25 of 29
102. (stack b1 b24)
   deleted: (clear b24) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b24)
   goals met: 26 of 29
103. (pickup b16)
   deleted: (clear b16) (on-table b16) (arm-empty)
   added: (holding b16)
   goals met: 26 of 29
104. (stack b16 b1)
   deleted: (clear b1) (holding b16)
   added: (arm-empty) (clear b16) (on b16 b1)
   goals met: 27 of 29
105. (unstack b12 b27)
   deleted: (on b12 b27) (clear b12) (arm-empty)
   added: (holding b12) (clear b27)
   goals met: 26 of 29
106. (putdown b12)
   deleted: (holding b12)
   added: (clear b12) (arm-empty) (on-table b12)
   goals met: 26 of 29
107. (unstack b27 b25)
   deleted: (on b27 b25) (clear b27) (arm-empty)
   added: (holding b27) (clear b25)
   goals met: 25 of 29
108. (putdown b27)
   deleted: (holding b27)
   added: (clear b27) (arm-empty) (on-table b27)
   goals met: 25 of 29
109. (pickup b25)
   deleted: (clear b25) (on-table b25) (arm-empty)
   added: (holding b25)
   goals met: 25 of 29
110. (stack b25 b15)
   deleted: (clear b15) (holding b25)
   added: (arm-empty) (clear b25) (on b25 b15)
   goals met: 26 of 29
111. (pickup b27)
   deleted: (clear b27) (on-table b27) (arm-empty)
   added: (holding b27)
   goals met: 26 of 29
112. (stack b27 b25)
   deleted: (clear b25) (holding b27)
   added: (arm-empty) (clear b27) (on b27 b25)
   goals met: 27 of 29
113. (pickup b12)
   deleted: (clear b12) (on-table b12) (arm-empty)
   added: (holding b12)
   goals met: 27 of 29
114. (stack b12 b27)
   deleted: (clear b27) (holding b12)
   added: (arm-empty) (clear b12) (on b12 b27)
   goals met: 28 of 29
115. (unstack b16 b1)
   deleted: (on b16 b1) (clear b16) (arm-empty)
   added: (holding b16) (clear b1)
   goals met: 27 of 29
116. (putdown b16)
   deleted: (holding b16)
   added: (clear b16) (arm-empty) (on-table b16)
   goals met: 27 of 29
117. (unstack b1 b24)
   deleted: (on b1 b24) (clear b1) (arm-empty)
   added: (holding b1) (clear b24)
   goals met: 26 of 29
118. (putdown b1)
   deleted: (holding b1)
   added: (clear b1) (arm-empty) (on-table b1)
   goals met: 26 of 29
119. (unstack b24 b21)
   deleted: (on b24 b21) (clear b24) (arm-empty)
   added: (holding b24) (clear b21)
   goals met: 25 of 29
120. (putdown b24)
   deleted: (holding b24)
   added: (clear b24) (arm-empty) (on-table b24)
   goals met: 25 of 29
121. (unstack b21 b5)
   deleted: (on b21 b5) (clear b21) (arm-empty)
   added: (holding b21) (clear b5)
   goals met: 24 of 29
122. (putdown b21)
   deleted: (holding b21)
   added: (clear b21) (arm-empty) (on-table b21)
   goals met: 24 of 29
123. (unstack b5 b9)
   deleted: (on b5 b9) (clear b5) (arm-empty)
   added: (holding b5) (clear b9)
   goals met: 23 of 29
124. (putdown b5)
   deleted: (holding b5)
   added: (clear b5) (arm-empty) (on-table b5)
   goals met: 23 of 29
125. (pickup b24)
   deleted: (clear b24) (on-table b24) (arm-empty)
   added: (holding b24)
   goals met: 23 of 29
126. (stack b24 b21)
   deleted: (clear b21) (holding b24)
   added: (arm-empty) (clear b24) (on b24 b21)
   goals met: 24 of 29
127. (unstack b9 b7)
   deleted: (on b9 b7) (clear b9) (arm-empty)
   added: (holding b9) (clear b7)
   goals met: 23 of 29
128. (putdown b9)
   deleted: (holding b9)
   added: (clear b9) (arm-empty) (on-table b9)
   goals met: 23 of 29
129. (pickup b7)
   deleted: (clear b7) (on-table b7) (arm-empty)
   added: (holding b7)
   goals met: 23 of 29
130. (stack b7 b29)
   deleted: (clear b29) (holding b7)
   added: (arm-empty) (clear b7) (on b7 b29)
   goals met: 24 of 29
131. (pickup b9)
   deleted: (clear b9) (on-table b9) (arm-empty)
   added: (holding b9)
   goals met: 24 of 29
132. (stack b9 b7)
   deleted: (clear b7) (holding b9)
   added: (arm-empty) (clear b9) (on b9 b7)
   goals met: 25 of 29
133. (pickup b5)
   deleted: (clear b5) (on-table b5) (arm-empty)
   added: (holding b5)
   goals met: 25 of 29
134. (stack b5 b9)
   deleted: (clear b9) (holding b5)
   added: (arm-empty) (clear b5) (on b5 b9)
   goals met: 26 of 29
135. (pickup b16)
   deleted: (clear b16) (on-table b16) (arm-empty)
   added: (holding b16)
   goals met: 26 of 29
136. (stack b16 b1)
   deleted: (clear b1) (holding b16)
   added: (arm-empty) (clear b16) (on b16 b1)
   goals met: 27 of 29
137. (unstack b24 b21)
   deleted: (on b24 b21) (clear b24) (arm-empty)
   added: (holding b24) (clear b21)
   goals met: 26 of 29
138. (putdown b24)
   deleted: (holding b24)
   added: (clear b24) (arm-empty) (on-table b24)
   goals met: 26 of 29
139. (pickup b21)
   deleted: (clear b21) (on-table b21) (arm-empty)
   added: (holding b21)
   goals met: 26 of 29
140. (stack b21 b5)
   deleted: (clear b5) (holding b21)
   added: (arm-empty) (clear b21) (on b21 b5)
   goals met: 27 of 29
141. (pickup b24)
   deleted: (clear b24) (on-table b24) (arm-empty)
   added: (holding b24)
   goals met: 27 of 29
142. (stack b24 b21)
   deleted: (clear b21) (holding b24)
   added: (arm-empty) (clear b24) (on b24 b21)
   goals met: 28 of 29
143. (unstack b16 b1)
   deleted: (on b16 b1) (clear b16) (arm-empty)
   added: (holding b16) (clear b1)
   goals met: 27 of 29
144. (putdown b16)
   deleted: (holding b16)
   added: (clear b16) (arm-empty) (on-table b16)
   goals met: 27 of 29
145. (pickup b1)
   deleted: (clear b1) (on-table b1) (arm-empty)
   added: (holding b1)
   goals met: 27 of 29
146. (stack b1 b24)
   deleted: (clear b24) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b24)
   goals met: 28 of 29
147. (pickup b16)
   deleted: (clear b16) (on-table b16) (arm-empty)
   added: (holding b16)
   goals met: 28 of 29
148. (stack b16 b1)
   deleted: (clear b1) (holding b16)
   added: (arm-empty) (clear b16) (on b16 b1)
   goals met: 29 of 29
